Revit 2026 API

# RoutingPreferenceRuleAddCriterion Method

---

Adds a new routing criterion.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddCriterion(
	RoutingCriterionBase myCriterion
)
```
```vb
Public Sub AddCriterion (
	myCriterion As RoutingCriterionBase
)
```
```cpp
public:
void AddCriterion(
	RoutingCriterionBase^ myCriterion
)
```
```fsharp
member AddCriterion :
        myCriterion : RoutingCriterionBase -> unit
```

#### Parameters

myCriterion RoutingCriterionBase
     The criterion to add.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RoutingPreferenceRule Class

Autodesk.Revit.DB Namespace